backend/app/controllers/lists_controller.rb

  def index
    lists = List.all
---
SELECT "lists".* FROM "lists"

  def create
    list = List.create(title: params[:title])
---
INSERT INTO "lists" ("title", "created_at", "updated_at") VALUES (?, ?, ?)  [["title", "Walmart"], ["created_at", "2021-05-01 01:32:51.658530"], ["updated_at", "2021-05-01 01:32:51.658530"]]

  def destroy
    list = List.find_by(id: params[:id])
    list.destroy
---
SELECT "lists".* FROM "lists" WHERE "lists"."id" = ? LIMIT ?  [["id", 15], ["LIMIT", 1]]
DELETE FROM "lists" WHERE "lists"."id" = ?  [["id", 15]]