backend/app/controllers/tasks_controller.rb

INSERT INTO "tasks" ("description", "created_at", "updated_at", "list_id") VALUES (?, ?, ?, ?)  [["description", "[object HTMLInputElement]"], ["created_at", "2021-05-01 16:14:25.535542"], ["updated_at", "2021-05-01 16:14:25.535542"], ["list_id", 1]]
---
    task = Task.create(description: params[:description], list_id: params[:list_id])

SELECT "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT ?  [["id", 12], ["LIMIT", 1]]
DELETE FROM "tasks" WHERE "tasks"."id" = ?  [["id", 12]]
---
    task = Task.find_by(id: params[:id])
    task.delete

SELECT "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
UPDATE "tasks" SET "completed" = ?, "updated_at" = ? WHERE "tasks"."id" = ?  [["completed", 1], ["updated_at", "2021-05-03 02:34:03.437828"], ["id", 4]]
---
    task = Task.find_by(id: params[:id])
    task.completed = !task.completed
    task.save